{
  "name": "Slann Starmaster",
  "flavor": "Ancient beings created to serve the Old Ones, the Starmasters are amongst the greatest wizards in all the realms. The powers of the heavens are theirs to command, the energies of the stars wielded to annihilate their enemies.",
  "points": 275,
  "role": ["leader"],
  "faction": "seraphon",
  "baseStats": {
    "move": 5,
    "wounds": 9,
    "save": 4,
    "bravery": 9
  },
  "isUnique": false,
  "unitSize": 1,
  "keywords": ["order", "seraphon", "slaan", "hero", "wizard", "starmaster"],
  "weapons": [
    {
      "name": "Azure Lightning",
      "type": "melee",
      "stats": [
        {
          "range": {
            "value": "3",
            "damageTable": null
          }
        },
        {
          "attacks": {
            "value": "6",
            "damageTable": null
          }
        },
        {
          "to hit": {
            "value": "3",
            "damageTable": null
          }
        },
        {
          "to wound": {
            "value": "3",
            "damageTable": null
          }
        },
        {
          "rend": {
            "value": "-1",
            "damageTable": null
          }
        },
        {
          "damage": {
            "value": "1",
            "damageTable": null
          }
        }
      ],
      "choice": false
    }
  ],
  "canFly": true,
  "isWizard": true,
  "abilities": [
    {
      "name": "Arcane Vassal",
      "description": "Once per phase, when this unit attempts to cast a spell, before making the casting roll, you can pick either 1 friendly SKINK WIZARD within 12\" of this unit or 1 friendly ORACLE anywhere on the battlefield. If you do so and the spell is successfully cast and not unbound, you must measure the range and visibility for that spell from that SKINK WIZARD or ORACLE.",
      "phase": "all",
      "flavor": "A Slann Starmaster can channel the power of a spell through one of their followers."
    },
    {
      "name": "Foresight",
      "description": "At the start of your hero phase, roll 2 dice for this unit. For each 4+, you receive 1 command point.",
      "phase": "hero",
      "flavor": "The Starmaster casts their mind into the future, reading the threads of destiny as easily as a mortal would read a map."
    },
    {
      "name": "Gift from the Heavens",
      "description": "You can use this command ability in your hero phase. The command can only be issued by this unit, and the unit that receives the command must be a friendly SERAPHON unit. Until your next hero phase, that unit can fly. In addition, add 1 to save rolls for attacks made with missile weapons that target that unit until your next hero phase.",
      "phase": "hero",
      "flavor": "At a Starmaster’s command, their followers are wrapped in a mantle of Azyrite energy, allowing them to disregard the natural laws that govern the realms.",
      "type": "command"
    },
    {
      "name": "Masters of Order",
      "description": "Add 1 to casting, dispelling and unbinding rolls for this unit. In addition, this unit can attempt to unbind enemy spells that are cast anywhere on the battlefield and attempt to dispel endless spells anywhere on the battlefield.",
      "flavor": "The slann are amongst the greatest wizards in existence, and they shape the very stars with their magic.",
      "phase": "all"
    }
  ],
  "spells": [
    {
      "name": "Celestial Equilibrium",
      "description": "Celestial Equilibrium is a spell that has a casting value of 6. If successfully cast, until the end of the phase, add 1 to casting rolls for friendly WIZARDS other than the caster.",
      "flavor": "The slann’s form seems to shimmer and fade as it draws links between their allies and the turnings of the stars.",
      "castingValue": 6,
      "range": null
    },
    {
      "name": "Shield of the Old Ones",
      "description": "Shield of the Old Ones is a spell that has a casting value of 7. If successfully cast, the caster has a ward of 4+ against mortal wounds until your next hero phase.",
      "flavor": "The Starmaster weaves the very substance of the cosmos into a formidable arcane barrier.",
      "castingValue": 7,
      "range": null
    }
  ]
}
